[33m247eaf6[m[33m ([m[1;36mHEAD -> [m[1;32mBegachu[m[33m, [m[1;31morigin/master[m[33m, [m[1;32mmaster[m[33m)[m 20200727 Begachu npm 통해 responsive-screen 추가
[33m9aaa248[m 20200727 Begachu height 값 %에서 정수로 천환
[33mf5601fd[m 20200727 Begachu 파일명 수정
[33me3ccea1[m 20200727 Begachu 검색창 추가
[33m75e45ba[m 20200727 Begachu 방만들기 버튼 추가
[33m575e387[m 20200727 Begachu Hot 주문 컴포넌트 추가
[33m5094855[m 20200727 Begachu hot주문 컴포넌트 주석 수정
[33m06d6db7[m 20200727 Begachu hot주문 컴포넌트 추가
[33m1abbc05[m 20200727 Begachu 컨테이너 style 수정
[33m47b54f8[m 20200727 Begachu headline 글씨 크기 변경
[33mbcfc485[m 20200727 Begachu 현재인기메뉴목록 컴포넌트 생성
[33m94f5aa6[m 20200727 Begachu 터치버튼 style 수정
[33m6c4295f[m 20200727 Begachu 터치버튼 style 수정
[33m052219f[m 20200727 Begachu 터치버튼 추가
[33m000eff0[m 20200727 Begachu 홈화면 '위치바' 위치 수정
[33m314e6b3[m 20200727 Begachu 네비게이션 style 수정
[33me41da92[m 20200727 Begachu 모드별 선책화면 기본 style 변경
[33m245749c[m 20200727 Begachu Home화면의 '위치 창' 구현
[33m20a5fae[m 20200727 Begachu 모드별 화면들이 유저 정보를 받게 수정
[33ma573c4e[m 20200727 Begachu 모드별 화면들이 유저 정보를 받게 수정
[33m6eab2be[m 20200727 Begachu 코드 정리
[33md542f98[m 20200727 Begachu 유저 정보를 저장할 state 추가
[33m03dcb88[m 20200727 Begachu 네비게이션 버튼 크기 수정
[33m4302fec[m 20200727 Begachu 불필요한 메소드 제거 및 주석 수정
[33mdd9bc8e[m 20200727 Begachu 주석 수정
[33md5f6c90[m 20200727 Begachu 네비게이션 버튼 위치 수정
[33mf58cc0a[m 20200727 Begachu 상단 네비게이션 버튼 위치 조정
[33m55261d3[m 20200727 Begachu 네비게이션 버튼 디자인 변경
[33m1faf570[m 20200727 Begachu 좌측상단 네이게이션 버튼 생성
[33ma01ae2c[m 20200726 Begachu header 부분 크기&text 위치 수정
[33m32671d9[m 20200726 Begachu 선택 모드로 화면 전환되게 수정
[33m92b5c9f[m 20200726 Begachu 모드별 기본화면 추가
[33m19434a9[m 20200726 Begachu 모드별 화면 추가
[33m300d0bb[m 20200726 Begachu 클릭시 alert 삭제
[33mf2936f7[m 20200726 Begachu 디자인 일부 수정(색상, 크기)
[33m90ab26b[m 20200726 Begachu 선택된 모드 색상 변경
[33m286492b[m 20200726 Begachu 초기모드 home으로 변경
[33me26b911[m 20200726 Begachu 실행을 위한 expo 추가
[33me988841[m 20200725 MINIBEEF 레포 재구조화
[33m7b88ab6[m 메뉴버튼 이벤트 오류 수정
[33me283ba9[m App.js와 구현한 컴포넌트 폴더 추가
[33m28339a1[m 프로젝트 폴더 추가
[33m3e095bc[m Begachu_front 폴더 생성 및 react-native 프로젝트 추가
[33m8206a71[m Make ire4564 directory
[33m84bf108[m Update README.md
[33m3d5f1f3[m Update README.md
[33m50f2144[m Update README.md
[33mda65f0f[m Read Me
